# 6) ვისაც წინა საშინაო დავალება არ გაგიკეთებიათ, დაფიქრდით და აუცილებლად გააკეთეთ:
# მომხმარებელს შემოატანინეთ რიცხვი და დაწერეთ პროგრამა, რომელიც შეამოწმებს
# ეს რიცხვი მარტივია თუ არა. (მარტივია რიცხვი, თუ მას მხოლოდ ორი გამყოფი აქვს).
# მინიშნება: გამოიყენეთ For loop და % გამყოფი ოპერატორი, ასევე აუცილებლად
# დაგჭირდებათ პროგრამაში Boolean ნიშვნელობების გამოყენება (True და False).



user_input = int(input("enter your number: "))

count = 0

for i in range(1,user_input):
    if user_input % i == 0:
        count = count + 1
if count > 1:
    print("False")
else:
    print(True)    
        
